package org.example;

public class MyQueue {



//    Написать свой класс MyQueue как аналог классу Queue, который будет работать по принципу FIFO (first-in-first-out).
//
//    Можно делать либо с помощью Node либо с помощью массива.
//
//    Методы
//
//    add(Object value) добавляет элемент в конец
//    clear() очищает коллекцию
//    size() возвращает размер коллекции
//    peek() возвращает первый элемент в очереди (FIFO)
//    poll() возвращает первый элемент в очереди и удаляет его из коллекции
}
